In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series,DataFrame

In [4]:
from numpy.random import randn

# Pivoting

In [18]:
a=DataFrame({'Data':[1,2,3,1,2,3,1,2,3,1,2,3],'Values':np.random.randn(12),'Variable':['a','s','d','f','g','h','j','k','l','z','x','c']})

In [19]:
a

    Data    Values Variable
0      1  1.286456        a
1      2  0.046677        s
2      3 -0.591494        d
3      1 -0.226403        f
4      2  0.278967        g
5      3  1.268145        h
6      1  0.774212        j
7      2  0.274196        k
8      3  1.349799        l
9      1  0.954842        z
10     2 -0.973954        x
11     3  0.490616        c

In [20]:
b=a.pivot('Data','Variable','Values')           #( rox , column , with respect to)

In [21]:
b

Variable,a,c,d,f,g,h,j,k,l,s,x,z
Data,,,,,,,,,,,,
1,1.286456,NaN,NaN,-0.226403,NaN,NaN,0.774212,NaN,NaN,NaN,NaN,0.954842
2,NaN,NaN,NaN,NaN,0.278967,NaN,NaN,0.274196,NaN,0.046677,-0.973954,NaN
3,NaN,0.490616,-0.591494,NaN,NaN,1.268145,NaN,NaN,1.349799,NaN,NaN,NaN

In [28]:
c=DataFrame({'Data':[1,2,3,1,2,3,1,2,3,1,2,3],'Values':np.random.randn(12),'Variable':['a','b','b','b','b','a','a','a','c','c','c','c']})

In [29]:
d=c.pivot('Data','Values','Variable')           #( rox , column , with respect to)

In [30]:
d

Values,-1.800268,-1.424626,-0.752982,-0.537338,-0.236968,0.281683,0.416590,0.512769,0.551875,1.013743,1.215147,1.489930
Data,,,,,,,,,,,,
1,NaN,NaN,a,b,NaN,NaN,NaN,NaN,c,NaN,NaN,a
2,NaN,NaN,NaN,NaN,b,a,NaN,b,NaN,c,NaN,NaN
3,b,c,NaN,NaN,NaN,NaN,c,NaN,NaN,NaN,a,NaN

In [32]:
e=c.pivot('Values','Data','Variable')           #( rox , column , with respect to)

In [33]:
e

Data         1    2    3
Values
-1.800268  NaN  NaN    b
-1.424626  NaN  NaN    c
-0.752982    a  NaN  NaN
-0.537338    b  NaN  NaN
-0.236968  NaN    b  NaN
 0.281683  NaN    a  NaN
 0.416590  NaN  NaN    c
 0.512769  NaN    b  NaN
 0.551875    c  NaN  NaN
 1.013743  NaN    c  NaN
 1.215147  NaN  NaN    a
 1.489930    a  NaN  NaN

In [34]:
f=c.pivot('Variable','Values','Data')           #( rox , column , with respect to)

In [35]:
f

Values,-1.800268,-1.424626,-0.752982,-0.537338,-0.236968,0.281683,0.416590,0.512769,0.551875,1.013743,1.215147,1.489930
Variable,,,,,,,,,,,,
a,NaN,NaN,1.0,NaN,NaN,2.0,NaN,NaN,NaN,NaN,3.0,1.0
b,3.0,NaN,NaN,1.0,2.0,NaN,NaN,2.0,NaN,NaN,NaN,NaN
c,NaN,3.0,NaN,NaN,NaN,NaN,3.0,NaN,1.0,2.0,NaN,NaN

# Combining Series

In [20]:
s1=Series([2,np.nan,3,np.nan,4,np.nan],index=['Q','R','S','T','U','V'])

In [21]:
s2=Series([0,1,2,3,4,np.nan],index=['Q','R','S','T','U','V'])

In [22]:
s1,s2

(Q    2.0
 R    NaN
 S    3.0
 T    NaN
 U    4.0
 V    NaN
 dtype: float64,
 Q    0.0
 R    1.0
 S    2.0
 T    3.0
 U    4.0
 V    NaN
 dtype: float64)

In [12]:
a=Series(np.where(s1.notnull(),s1,s2))             #......fills s2 values where s1 is null

In [13]:
a

0    2.0
1    1.0
2    3.0
3    3.0
4    4.0
5    NaN
dtype: float64

In [14]:
b=Series(np.where(s2.notnull(),s2,s1))             #......fills s1 values where s2 is null

In [15]:
b

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    NaN
dtype: float64

In [23]:
s1.combine_first(s2)

Q    2.0
R    1.0
S    3.0
T    3.0
U    4.0
V    NaN
dtype: float64

In [24]:
s2.combine_first(s1)

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    NaN
dtype: float64

In [26]:
s1=Series([2,np.nan,3,np.nan,4,np.nan],index=['Q','R','S','T','U','V'])

In [27]:
s3=Series([2,np.nan,3,np.nan,4,np.nan],index=['q','r','s','t','u','v'])

In [28]:
s1.combine_first(s3)

Q    2.0
R    NaN
S    3.0
T    NaN
U    4.0
V    NaN
q    2.0
r    NaN
s    3.0
t    NaN
u    4.0
v    NaN
dtype: float64

In [30]:
s3.combine_first(s1)

Q    2.0
R    NaN
S    3.0
T    NaN
U    4.0
V    NaN
q    2.0
r    NaN
s    3.0
t    NaN
u    4.0
v    NaN
dtype: float64

# Combining DataFrame

In [34]:
a=DataFrame([[1,np.nan,np.nan],[np.nan,5,9],[3,np.nan,np.nan],[np.nan,7,1]])

In [40]:
b=DataFrame([[2,np.nan],[4,19],[np.nan,12],[6,14],[8,16]])

In [41]:
a

     0    1    2
0  1.0  NaN  NaN
1  NaN  5.0  9.0
2  3.0  NaN  NaN
3  NaN  7.0  1.0

In [42]:
b

     0     1
0  2.0   NaN
1  4.0  19.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [43]:
a.combine_first(b)

     0     1    2
0  1.0   NaN  NaN
1  4.0   5.0  9.0
2  3.0  12.0  NaN
3  6.0   7.0  1.0
4  8.0  16.0  NaN

In [44]:
b.combine_first(a)

     0     1    2
0  2.0   NaN  NaN
1  4.0  19.0  9.0
2  3.0  12.0  NaN
3  6.0  14.0  1.0
4  8.0  16.0  NaN

# Duplicates in DataFrame

In [52]:
a=DataFrame({'Key 1':['a','a','b','b','b'],'Key 2':[2,2,2,3,3]})

In [53]:
a

  Key 1  Key 2
0     a      2
1     a      2
2     b      2
3     b      3
4     b      3

In [54]:
a.duplicated()           # duplicates are given with respect to the above one

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [56]:
a.drop_duplicates()

  Key 1  Key 2
0     a      2
2     b      2
3     b      3

In [59]:
a.drop_duplicates('Key 1')

  Key 1  Key 2
0     a      2
2     b      2

In [60]:
a

  Key 1  Key 2
0     a      2
1     a      2
2     b      2
3     b      3
4     b      3

In [58]:
a.drop_duplicates('Key 2')

  Key 1  Key 2
0     a      2
3     b      3

In [63]:
a.drop_duplicates(['Key 1'],keep='last')

  Key 1  Key 2
1     a      2
4     b      3

In [64]:
#....is checked from bottom, so keeps the last one as acceptable and rejects the next duplicate as it goes up